** Publishing
#+BEGIN_SRC emacs-lisp
(require 'ox-publish)
(setq public-html "~/mstrey/public_html/")
(defun rename-sarad (project-plist)
  "Rename sarad.html into index.html"
  (let ((htmlfile (concat public-html "todo/sarad.html")))
    (if (file-exists-p htmlfile)
        (rename-file htmlfile
                     (concat public-html "todo/index.html") t))))
(setq org-publish-project-alist
      `(("org-notes"
         :base-directory "~/mstrey/Work/GTD_Sarad/"
         :base-extension "org"
         :publishing-directory ,(concat public-html "todo/")
         :recursive t
         :publishing-function org-html-publish-to-html
         :section-numbers nil
         :with-archived-trees t
         :with-latex t
         :with-smart-quotes t
         :with-sub-superscript nil
         :with-timestamps t
         :html-doctype "html5"
         :html-html5-fancy t
         :html-head-include-default-style nil
         :html-preamble t
         :html-validation-link nil
         :completion-function rename-sarad)
        ("org-static"
         :base-directory "~/mstrey/Work/GTD_Sarad/"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|org\\|odt"
         :exclude "sarad.org"
         :publishing-directory ,(concat public-html "todo/")
         :recursive t
         :publishing-function org-publish-attachment)
        ("org" :components ("org-notes" "org-static"))))
#+END_SRC

#+RESULTS:
| org-notes  | :base-directory | ~/mstrey/Work/GTD_Sarad/ | :base-extension | org  | :publishing-directory | ~/mstrey/public_html/todo/ | :recursive | t    | :publishing-function | org-html-publish-to-html | :section-numbers | nil  | :with-archived-trees | t   | :with-latex | t         | :with-smart-quotes    | t                          | :with-sub-superscript | nil | :with-timestamps     | t                      | :html-doctype | html5 | :html-html5-fancy | t | :html-head-include-default-style | nil | :html-preamble | t | :html-validation-link | nil | :completion-function | rename-sarad |
| org-static | :base-directory | ~/mstrey/Work/GTD_Sarad/ | :base-extension | css\ | js\                   | png\                       | jpg\       | gif\ | pdf\                 | mp3\                     | ogg\             | swf\ | org\                 | odt | :exclude    | sarad.org | :publishing-directory | ~/mstrey/public_html/todo/ | :recursive            | t   | :publishing-function | org-publish-attachment |               |       |                   |   |                                  |     |                |   |                       |     |                      |              |
| org        | :components     | (org-notes org-static)   |                 |      |                       |                            |            |      |                      |                          |                  |      |                      |     |             |           |                       |                            |                       |     |                      |                        |               |       |                   |   |                                  |     |                |   |                       |     |                      |              |

